Revit 2027 API
ExternalServices.BuiltInExternalServices.AnalyticalCurrentCalculationService Property
 AnalyticalCurrentCalculationService GUID value:{96BBB101-FDDB-4991-BB41-FBC1BE1552BB} The calculation service for Electrical Analytical Distribution System
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId AnalyticalCurrentCalculationService { get; }
Public Shared ReadOnly Property AnalyticalCurrentCalculationService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ AnalyticalCurrentCalculationService {
	ExternalServiceId^ get ();
}
static member AnalyticalCurrentCalculationService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace